Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །གཞོན་ནུ་ཐམས་ཅད་སྒྲོལ་དད་པ་བཟང་བ། དགེ་བའི་བསམ་པ་ཅན།
en: “Prince Viśvantara was pious, good, and of a virtuous disposition.

source: བདག་ལ་ཕན་པ་དང་། གཞན་ལ་ཕན་པར་ཞུགས་པ།
en: He benefited himself and others.

source: སྙིང་རྗེ་ཅན་བདག་ཉིད་ཆེན་པོ་ཆོས་འདོད་པ། སྐྱེ་དགུ་རྣམས་ལ་བྱམས་པ།
en: He was merciful, a great individual who wished for the Dharma, and he was loving to beings.

source: ཐམས་ཅད་སྦྱིན་པ། ཐམས་ཅད་གཏོང་བ། ཆགས་པ་མེད་པར་གཏོང་བ། གཏོང་བ་ཆེན་པོ་ལ་ཞུགས་པ་ཡིན་ནོ།
en: He offered everything, gave everything, gave without attachment, and engaged himself in great donations.

source: །དེའི་གཏོང་བ་རྒྱ་ཆེན་པོ་ཐོས་ནས་དཔག་ཚད་བརྒྱ་ནས་ཀྱང་དོན་དུ་གཉེར་བའི་སྐྱེ་བོ་འོངས་ཏེ་ཐམས་ཅད་ཀྱང་ཡིད་ལ་རེ་བ་རྫོགས་པར་བྱས་ནས་གཏོང་ངོ་།
en: Having heard of his huge donations, seekers came from even a hundred yojanas away, and everyone was given something, their wishes satisfied.

source: །དེ་ནས་རེ་ཞིག་ཅིག་ན་བྱང་ཆུབ་སེམས་དཔས་ཤིང་རྟ་ནོར་བུ་དང་གསེར་དང་དངུལ་དང་། རྡོ་རྗེ་དང་། བཻ་ཌཱུརྱ་དང་། སྤུག་དང་། པད་མ་རཱ་ག་དང་། ཨིནྡྲ་ནཱི་ལས་འབར་བར་བྱས་པ།
en: “One day, the bodhisattva mounted the most excellent chariot, one glittering with jewels, gold, silver, diamonds, lapis lazuli, emeralds, rubies, and sapphires;

source: ཙན་དན་མཆོག་གི་སྙིང་པོ་ལས་བསྒྲུབས་པ། སེང་གེ་དང་སྟག་དང་གུང་གི་པགས་པས་གཡོགས་པ།
en: made with a core of the best sandalwood, covered with the skins of a lion, tiger, and leopard;

source: རྟ་རླུང་གི་ཤུགས་ལྟར་མགྱོགས་པ།
en: that ran as fast as the wind;

source: གསེར་དང་དངུལ་གྱི་དྲིལ་བུ་གཡེར་ཀའི་སྒྲ་འཁྲོལ་བ་བཞི་དང་ལྡན་པ་མཆོག་གི་ནང་དུ་ཞུགས་ནས་གྲོང་ཁྱེར་དམ་པ་ནས་སྐྱེད་མོས་ཚལ་དུ་མངོན་དུ་སོང་ངོ་།
en: and pulled by four horses sounding small golden and silver bells. He traveled in it from the most excellent city to a park.

source: །དེ་ནས་བྲམ་ཟེ་རིག་བྱེད་དང་རིག་བྱེད་ཀྱི་ཡན་ལག་ཤེས་པ་ཁ་ཅིག་གིས་ཐམས་ཅད་སྒྲོལ་མངོན་དུ་བསུ་ནས་སྨྲས་པ།
en: “Then certain brahmins who had mastered the Vedas and auxiliary branches of the Vedas saw Viśvantara and greeted him:

source: རྒྱལ་རིགས་གཞོན་ནུ་ཁྱོད་རྒྱལ་བར་གྱུར་ཅིག །ཡང་སྨྲས་པ།
en: ‘O kṣatriya prince, victory to you!’ They also said:

source: ཁྱོད་ནི་འཇིག་རྟེན་ཐམས་ཅད་དུ།
en: “ ‘All over the world, you are

source: །ཐམས་ཅད་གཏོང་ཞེས་རྣམ་པར་གྲགས།
en: Renowned as Sarvaṃdada, “Giver of Everything.”

source: །བྲམ་ཟེ་རྣམས་ལ་ཤིང་རྟ་འདི།
en: It is therefore appropriate for you to give this chariot

source: །ཁྱོད་ཀྱིས་སྦྱིན་པ་གཏང་བའི་རིགས།
en: As a donation to brahmins.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་སྒྲོལ་ཤིང་རྟ་དེ་ལས་མྱུར་བ་མྱུར་བར་བབས་ཏེ་སྙིང་དགའ་བ་དང་མགུ་བ་དང་། རབ་ཏུ་དགའ་བས་བྲམ་ཟེ་དེ་དག་ལ་ཤིང་རྟ་བྱིན་ནས་སྨྲས་པ།
en: “Having been told this, the bodhisattva Viśvantara quickly descended from the chariot. With his heart pleased, delighted, and gladdened, he gave the chariot to the brahmins and said:

source: བདག་གིས་ཇི་ལྟར་བྲམ་ཟེ་ལ། །མཆོག་ཏུ་དགའ་བས་ཤིང་རྟ་བཏང་།
en: “ ‘Just as I give the chariot To brahmins with great pleasure,

source: །དེ་བཞིན་བདག་གིས་སྲིད་པ་གསུམ།
en: May I give away everything in the three realms of existence

source: །བཏང་ནས་བྱང་ཆུབ་མཆོག་རེག་ཤོག། །།འདུལ་བ་གཞི། བམ་པོ་བཞི་བཅུ་རྩ་དྲུག་པ།
en: And attain supreme awakening.’

source: དེ་དུས་གཞན་ཞིག་ན་གླང་པོ་ཆེའི་མཆོག་རྒྱལ་སྲིད་འཕེལ་ཞེས་བྱ་བ་མེ་ཏོག་ཀུན་ད་དང་། ཀུ་མུ་ད་དང་། ཁ་བ་དང་། དངུལ་དང་། སྤྲིན་དཀར་པོ་ལྟ་བུའི་མདོག་ཅན་བདུན་ལེགས་པར་གནས་ཤིང་རྐང་ལག་ལེགས་པར་གནས་པ།
en: “Later, when spring came, he mounted the most excellent elephant, named Rājyavardhana, whose color was white like flowers such as jasmine and white water lily, snow, silver, and white clouds; whose body was well supported in its seven parts;

source: གླང་པོ་ཆེ་ས་སྲུང་གི་བུ་ལྟར་འགྱིང་ཞིང་འགྲོ་བ། རང་བཞིན་གྱི་མཚན་མཆོག་གིས་བརྒྱན་པ།
en: whose feet were well supported, and who walked majestically like the elephant Airāvaṇa, was adorned with the best characteristics, and was auspicious to behold.

source: མཐོང་ན་བཀྲ་ཤིས་པ་ལ་ཞོན་ནས་ཤིན་ཏུ་སྡུག་པའི་བྲན་དང་། མཛའ་བཤེས་དང་། གཡོག་རྣམས་ཕྱི་བཞིན་འབྲང་ཞིང་ཟླ་བ་རྒྱུ་སྐར་གྱི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་བཞིན་དུ་སོས་ཀའི་དུས་ལ་བབ་པས་ཤིང་རྣམས་མེ་ཏོག་ཁ་འབུས་ཤིང་།
en: He went to a park in a forest where the trees were budding, and birds such as haṃsas, curlews, peacocks, parrots, hill mynas, cuckoos, and jīvaṃjīvakas were singing, followed by his favorite slaves, friends, and servants like the moon surrounded by stars.

source: ངང་པ་དང་། ཁྲུང་ཁྲུང་དང་། རྨ་བྱ་དང་། ནེ་ཙོ་དང་། རི་སྐེགས་དང་། ཁུ་བྱུག་དང་། ཤང་ཤང་ཏེའུ་སྒྲ་འབྱིན་པའི་ནགས་ཚལ་གྱི་སྐྱེད་མོས་ཚལ་གྱི་སར་སོང་བ་དང་། དེ་ནས་ཕྱིར་རྒོལ་བས་སྦད་པའི་བྲམ་ཟེ་ཁ་ཅིག་གཞོན་ནུ་ཐམས་ཅད་སྒྲོལ་གྱི་དྲུང་དུ་རིངས་པ་རིངས་པར་འོངས་ནས།
en: “Then, certain brahmins sent by an enemy quickly approached Prince Viśvantara and greeted him:

source: རྒྱལ་རིགས་གཞོན་ནུ་ཁྱོད་རྒྱལ་བར་གྱུར་ཅིག་ཅེས་སྨྲས་ནས་ཡང་སྨྲས་པ།
en: ‘O kṣatriya prince, victory to you!’ They also said:

source: ལྷ་མིན་ལྷར་བཅས་འཇིག་རྟེན་དུ།
en: “ ‘All over the world, including among the asuras and gods,

source: །ཁྱོད་ནི་ཐམས་ཅད་གཏོང་ཞེས་གྲགས།
en: You are renowned as Sarvaṃdada, “Giver of Everything.” It is therefore appropriate for you

source: །ཁྱོད་ཀྱི་གླང་པོའི་མཆོག་འདི་ནི། །བདག་ཅག་རྣམས་ལ་སྩལ་བའི་རིགས།
en: To give this most excellent elephant to us.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་གླང་པོའི་མཆོག་དེ་ལས་མྱུར་བ་མྱུར་བར་བབས་ནས་དགའ་བ་དང་། མགུ་བ་དང་། རབ་ཏུ་དགའ་བའི་ཡིད་ཀྱིས་དེ་དག་ལ་གླང་པོའི་མཆོག་དེ་བྱིན་ནས་སྨྲས་པ།
en: “Having been told this, the bodhisattva quickly dismounted from that most excellent elephant. With his mind pleased, delighted, and gladdened, he gave the best elephant to them and said:

source: བདག་གིས་ཇི་ལྟར་བྲམ་ཟེ་ལ། །མཆོག་ཏུ་དགའ་བས་གླང་ཆེན་བཏང་།
en: “ ‘Just as I give this most excellent elephant To brahmins with great pleasure,

source: །དེ་བཞིན་བདག་གིས་སྲིད་པ་གསུམ། །བཏང་ནས་བྱང་ཆུབ་མཆོག་རེག་ཤོག །རྒྱལ་པོ་ཐམས་ཅད་བཤེས་གཉེན་གྱིས་ཁྱོད་ཀྱི་སྲས་ཐམས་ཅད་སྒྲོལ་གྱིས་གླང་པོ་ཆེའི་མཆོག་རྒྱལ་སྲིད་འཕེལ་ཞེས་བྱ་བ་ཕྱིར་རྒོལ་བས་སྦད་པའི་བྲམ་ཟེ་རྣམས་ལ་བྱིན་ནོ་ཞེས་ཐོས་སོ།
en: May I give away everything in the three realms of existence And attain supreme awakening.’

source: །ཐོས་ནས་རྒྱལ་པོ་ཐམས་ཅད་བཤེས་གཉེན་ཤིན་ཏུ་ཁྲོས་འཁྲུགས་ནས་གཞོན་ནུ་ཐམས་ཅད་སྒྲོལ་བཀུག་སྟེ་སྨྲས་པ། གཞོན་ནུ་ཁྱོད་ངའི་ཡུལ་ན་མ་འདུག་པར་སོང་ཤིག །དེ་ནས་གཞོན་ནུ་ཐམས་ཅད་སྒྲོལ་ཕས་སྤངས་པ་དང་། བསམས་པ།
en: “King Viśvāmitra heard it said, ‘Your son Viśvantara gave the most excellent elephant, named Rājyavardhana, to the brahmins sent by our enemies.’ When he had heard this, King Viśvāmitra trembled with intense anger, summoned Prince Viśvantara, and shouted, ‘O Prince, you should not stay in my country.

source: བདག་གིས་བྱང་ཆུབ་ཀྱི་ཕྱིར་འབད་པར་བྱས་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་རྗེས་སུ་གཟུང་བའི་ཕྱིར་བརྩོན་འགྲུས་ཀྱི་གོ་ཆ་བགོས་པས་གླང་པོ་ཆེ་དེ་ཡང་བཏང་སྟེ།
en: Go away!’ “Having been abandoned by his father, Prince Viśvantara then thought, ‘Because I have been exerting myself for awakening and have put on the armor of effort in order to accept the whole world as my followers, I gave even that elephant.

source: དེ་བས་ཁྱིམ་ན་གནས་པས་ནི།
en: “ ‘Thus, living at home,

source: །ཅི་ནུས་པར་ནི་སྦྱིན་པ་བཏང་།
en: I have given as many donations as I could.

source: །དཀའ་ཐུབ་ནགས་སུ་བརྟེན་ནས་ནི།
en: Dwelling in the forest of ascetics,

source: །ངེས་པར་མཆོག་དག་བྱ་བ་ཡིན།
en: I should certainly do my best.

source: །བསླངས་ན་མི་སྦྱིན་ཞེས་བྱ་བ།
en: “ ‘If begged, I cannot say the words

source: །ཚིག་ནི་སྨྲ་བར་མི་ཕོད་ཀྱིས།
en: “I will not give.”

source: །དེ་བས་བདག་ནི་ཁྱིམ་སྤངས་ཏེ།
en: Therefore, I will relinquish my house

source: །དཀའ་ཐུབ་ནགས་སུ་རབ་ཏུ་འགྲོ།
en: And go to the forest of ascetics.’

source: །བྱང་ཆུབ་སེམས་དཔས་དེ་ལྟར་སྙིང་ལ་མནའ་མཐོ་བཅད་ནས་ཆུང་མ་རྒྱགས་སྦྱིན་མའི་དྲུང་དུ་སོང་སྟེ་དེ་དག་རྒྱས་པར་སྨྲས་སོ།
en: “Having made up his mind, the bodhisattva went to his wife, Mādrī, and explained these matters in detail.

source: །དེ་ནས་རྒྱགས་སྦྱིན་མས་ཐོས་མ་ཐག་ཏུ་སྡུག་པ་དང་བྲལ་བར་དོགས་པའི་སྙིང་གིས་ཐལ་མོ་སྦྱར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་ལ་སྨྲས་པ། རྗེའི་སྲས་གལ་ཏེ་དེ་ལྟ་ན་བདག་ཀྱང་དཀའ་ཐུབ་ཀྱི་ནགས་གནས་སུ་མཆི་སྟེ།
en: As soon as she heard them, Mādrī made the gesture of supplication, and then said to the bodhisattva, with her heart fearing separation from her husband, ‘My dear, if so, I too will go to the forest of ascetics.

source: བདག་ནི་རྗེའི་སྲས་དང་བྲལ་ན་སྐད་ཅིག་ཙམ་ཡང་འཚོ་བར་རྔོ་མི་ཐོག་ལགས་སོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Being apart from you, I would not be able to live even for one moment. Why?

source: ནམ་མཁའ་ཟླ་བས་སྟོངས་པར་གྱུར་པ་དང་། །ཇི་ལྟར་ས་ནི་ལོ་ཏོག་གིས་སྟོངས་དང་། །པད་མ་ཆུ་ཡིས་སྟོངས་པར་གྱུར་པ་དག །བུད་མེད་ཁྱིམ་ཐབ་ཀྱིས་སྟོངས་དེ་བཞིན་ནོ།
en: “ ‘The sky without the moon, The earth without crops, And a lotus without water: Such is a woman without her husband.’

source: །བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། བདག་ཅག་མཐར་གདོན་མི་ཟ་བར་འབྲལ་བར་འགྱུར་ཏེ།
en: “The bodhisattva said, ‘We will certainly part in the end.

source: འདི་ནི་འཇིག་རྟེན་གྱི་རང་བཞིན་ཡིན་ནོ།
en: That is the nature of the world.

source: །ཁྱོད་ནི་བཟའ་བ་དང་། བཏུང་བ་དང་། མལ་ཆ་དང་། བགོ་བ་མཆོག་ལ་གོམས་པས་ལུས་ཤིན་ཏུ་སྐྱིད་པ་ཡིན་དཀའ་ཐུབ་ཀྱི་ནགས་ན་ནི་རྩྭ་དང་ལོ་མ་བཏིང་བར་ནི་ཉལ་རྩ་བ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་ནི་ཟ།
en: Since you have been used to the best food, drink, bedding, and clothing, your body is very delicate.

source: རྩྭ་དཱུར་བ་དང་། ཟུག་རྡོ་དང་། རྩྭ་དང་། ཚེར་མས་གང་བའི་ས་ལ་ནི་རྒྱུ། ཡང་དང་ཡང་དུ་ཟ་གཅིག་པ་ལ་ནི་བརྟེན། བདག་ཉིད་སྐྱེ་བོ་ཐམས་ཅད་ལ་ནི་བསྟེན་དགོས། གློ་བུར་དུ་འོངས་པ་ཐམས་ཅད་མཆོད་པ་ལ་ནི་འབད་དགོས་ལ།
en: In the forest of ascetics, you have to lie on grass and leaves, eat roots, flowers, and fruits, walk on the ground full of darbha grass, stones, other kinds of grass, and thorns, rely always upon only one meal a day, and expose yourself to public scrutiny. You have to exert yourself to venerate every sudden guest.

source: དེ་ན་ཡང་ང་གདོན་མི་ཟ་བར་ཅི་ནུས་ཀྱི་སྦྱིན་པ་གཏོང་སྟེ།
en: Even there, I will certainly give as many donations as I can.

source: དེ་ལ་ཁྱོད་ཀྱིས་ཅུང་ཟད་ཀྱང་མི་འགྱོད་པར་བྱ་དགོས་སོ།
en: You should never regret this.

source: །དེ་བས་ན་རེ་ཞིག་ད་དུང་ཡང་ལེགས་པར་སོམས་ཤིག ། རྒྱགས་སྦྱིན་མས་སྨྲས་པ།
en: Therefore, give it adequate thought now.’

source: རྗེའི་སྲས་བདག་རྔོ་ཅི་ཐོག་གིས་རྗེའི་སྲས་ཀྱི་རྗེས་སུ་སྒྲུབ་ལགས་སོ།
en: “ ‘My dear,’ Mādrī replied, ‘I will follow you with all my might.’

source: །བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། གལ་ཏེ་དེ་ལྟ་ན་དམ་བཅས་པ་དེ་ཁྱོད་ཀྱིས་དྲན་པར་བྱོས་ཤིག །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཕའི་དྲུང་དུ་སོང་ནས་མགོ་བོས་ཕྱག་བྱས་ཏེ།
en: “The bodhisattva said to her, ‘If so, you should remember this promise.’ “Thereupon the bodhisattva went to his father. He bowed and said:

source: ཡབ་ཅིག་བདག་གིས་སྦྱིན་པར་གླང་ཆེན་སྩལ། །ནོངས་པ་གང་ལགས་ས་བདག་བཟོད་པར་གསོལ།
en: “ ‘Father, master of the earth, please forgive me for my fault, Which was my giving the great elephant as a donation.

source: །བདག་ནི་གྲོང་ནས་དགོན་པར་མཆི་ལགས་ཀྱིས།
en: I will leave the city and go to the wilderness.

source: །མི་ཡི་དབང་པོའི་ཕྱག་མཛོད་སྟོངས་མི་འགྱུར།
en: Your storehouse, O master of the people, will not become empty.

source: །དེ་ནས་རྒྱལ་པོ་བུ་དང་བྲལ་བའི་སྡུག་བསྔལ་གྱིས་དབུགས་ཀྱིས་བརྣངས་ཏེ་སྐད་འདར་འདར་པོར་སྨྲས་པ།
en: “Then the king gasped with the pain of being separated from his son and said in a trembling voice, ‘Son, change your thoughts of giving and stay.’

source: བུ་སྦྱིན་པའི་བློ་འོར་ལ་འདུག་ཤིག །བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ།
en: “The bodhisattva replied:

source: ས་ནི་རི་དང་བཅས་པར་ཡང་། །གལ་ཏེ་ལྡོག་པར་འགྱུར་གདའ་ཡང་།
en: “ ‘Even if the earth together with the mountains Turned back,

source: །ས་བདག་བདག་ནི་སྦྱིན་པ་ལས། །སེམས་ནི་ལྡོག་པར་མི་བགྱིད་དོ།
en: O master of the earth, I would not turn my mind Back from giving.’

source: །ཞེས་སྨྲས་ནས་སོང་ངོ་། །དེ་ནས་བུ་དང་། བུ་མོ་དང་། ཆུང་མ་དང་ལྷན་ཅིག་ཤིང་རྟའི་ནང་དུ་ཞུགས་ཏེ།
en: “Then, riding a chariot with his son, daughter, and wife, he departed the most excellent city.

source: གྲོང་ཁྱེར་དམ་པ་དེ་ནས་བྱུང་ནས་ཕོ་བྲང་འཁོར་གྱི་མི་དང་ཡུལ་མི་མྱ་ངན་བྱེད་པ་བརྒྱ་སྟོང་རྗེས་སུ་འབྲང་བཞིན་སོང་ངོ་། །དེ་ནས་མི་ཞིག་གིས་ངུ་ཞིང་སྨྲེ་སྔགས་འདོན་པའི་སྒྲ་དེ་ཡང་ཐོས། སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་གྲོང་ཁྱེར་གྱི་སྒོར་བྱུང་བ་ཡང་མཐོང་ནས་མི་ཞིག་ལ་དྲིས་པ།
en: A hundred thousand saddened citizens and provincial dwellers followed him. Then a man heard their crying, lamenting voices and saw the many people going out the city gate, and he asked another man, ‘My good man, many people are lamenting.

source: ཀྱེ་ནང་རྗེ་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་ཆོ་ངེས་འདེབས་པ་འདི་ཅི་ལས་གྱུར།
en: What has caused this?’

source: དེས་སྨྲས་པ། ཤེས་ལྡན་དག་ཅི་མི་ཤེས་སམ།
en: “He answered, ‘Sir, how do you not know?

source: འདི་ལྟར་མི་ཡི་དབང་པོས་ཉིད་ཀྱི་སྲས་པོ་མཆེ་བ་བཟང་།
en: “ ‘The master of the people has banished his own son, who has beautiful teeth,

source: །བརྟན་པའི་ངང་ཚུལ་རབ་ཏུ་སྦྱིན་ལ་དགའ་བ་འདི་ནི་སྤྱུགས།
en: Who is of a steadfast nature, who is pleased with giving.

source: །དེ་ནི་བུ་དང་ཆུང་མར་བཅས་ཏེ་ནགས་མཐར་ཆས་པ་ལ།
en: He is setting forth for the forest together with his children and wife,

source: །ཕོ་བྲང་འཁོར་བ་རྣམས་འདུས་ཤིན་ཏུ་སྙིང་རྗེས་ཆོ་ངེས་འདེབས།
en: And citizens have gathered and are lamenting with deep pity.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་གྲོང་ཁྱེར་དམ་པ་དེ་ནས་བྱུང་བའི་ཕོ་བྲང་འཁོར་གྱི་མི་རྣམས་ལ་ཅི་རིགས་པར་མངོན་དུ་སོང་ནས་སྨྲས་པ།
en: “Thereupon the bodhisattva approached in an appropriate manner the citizens who had left the most excellent city and said, ‘Sirs, go home, go home.

source: ཤེས་ལྡན་དག་སླར་དེང་ཤིག་སླར་དེང་ཤིག །འདི་ལྟར་ཤིན་ཏུ་ཡུན་རིང་པོ་ནས་སྡུག་པ་དང་འགྲོགས་པ་ཡང་མཇུག་ཏུ་གདོན་མི་ཟ་བར་འབྲལ་བའི་མཐའ་ཅན་དུ་འགྱུར་ཏེ།
en: Even if you stay with loved ones for a very long time, you will certainly end up parting from them.

source: གཉེན་པའི་སྐྱེ་བོ་དང་འགྲོགས་པ་ནི་ལམ་ཀའི་ངལ་བསོ་བའི་བསྟི་གནས་ཀྱི་ཤིང་དང་འདྲ་བས་གདོན་མི་ཟ་བར་སྡུག་པ་དང་འབྲལ་བར་འགྱུར་རོ།
en: Your relatives’ company is just like a tree under which you break the fatigue from traveling.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: So you will certainly part from loved ones. Why?

source: འཇིག་རྟེན་ཀུན་ན་སྐྱེ་བོ་དབང་མེད་དེ། །མཛའ་བ་རྣམས་དང་འབྲལ་བར་འགྱུར་བསམས་ནས།
en: “ ‘Thinking that everywhere in the world People are powerless to prevent parting from friends,

source: །ཁྱོད་ཀྱིས་ས་སྟེངས་འབད་པ་ཐམས་ཅད་ཀྱིས།
en: You should with every exertion on the face of the earth

source: །ཞི་ཕྱིར་བློ་གྲོས་མི་གཡོ་བརྟན་པར་གྱིས།
en: Make your resolve immovable and steadfast for the sake of tranquility.’

source: །དེ་ནས་དཔག་ཚད་སུམ་བརྒྱ་འདས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མཐོང་ནས་བྲམ་ཟེ་ཞིག་མངོན་དུ་འོངས་ཏེ་སྨྲས་པ།
en: “Then, a brahmin who had traveled for three hundred yojanas saw the bodhisattva and approached him.

source: ཀྱེ་རྒྱལ་རིགས་གཞོན་ནུ་བདག་ནི་ཁྱོད་ཀྱི་ཡོན་ཏན་ཐོས་ནས་འདི་ནས་དཔག་ཚད་སུམ་བརྒྱ་ཙམ་གྱི་ཡུལ་ནས་འདིར་མཆིས་ལགས་ཀྱིས།
en: He said, ‘O kṣatriya prince, having heard of your good qualities, I have come here from a country three hundred yojanas away.

source: ཁྱོད་ཀྱིས་ཤིང་རྟ་མཆོག་འདི་བདག་ངལ་བ་འབྲས་བུ་མཆིས་པར་བགྱི་བའི་རིགས་སོ།
en: It is therefore appropriate that you give me this most excellent chariot as a reward for my efforts.’

source: །དེ་ནས་རྒྱགས་སྦྱིན་མ་མི་བཟོད་པ་སྐྱེས་ནས་ཚིག་བརླངས་པོས་བྲམ་ཟེ་དེ་ལ་སྨྲས་པ།
en: “Unable to bear it, Mādrī shouted at the brahmin with harsh words: “ ‘Shame!

source: ཨེ་མའོ་ནགས་ནའང་མི་དབང་སྲས་ལ་སློང་བ་གང་།
en: Even in the forest he dares beg from the son of the people’s master.

source: །བྲམ་ཟེ་འདི་ནི་ཤིན་ཏུ་བརྩེ་བ་མེད་པའི་བློ།
en: This brahmin has an utterly pitiless mind.

source: །མི་དབང་སྲས་པོ་མི་དབང་དཔལ་ལས་ཉམས་གྱུར་པ།
en: The son of the people’s master has lost his royal wealth.

source: །འདི་ལ་འདིར་ནི་སྙིང་རྗེ་ཅིག་མི་སྐྱེ་འམ།
en: Does this man have no compassion for him?’

source: །བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། ཁྱོད་ཀྱིས་བྲམ་ཟེ་མ་སྤྱོ་ཤིག །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “The bodhisattva said, ‘You should not scold the brahmin. Why?

source: རྒྱགས་སྦྱིན་གལ་ཏེ་ནོར་འདོད་ལེན་པ་འདི་དག་མེད་གྱུར་ན།
en: “ ‘Mādrī, if those who desire and accept wealth did not exist,

source: །ཀུན་སྦྱིན་མེད་པར་མི་གང་ཞིག་གིས་ས་སྟེངས་བྱང་ཆུབ་འཐོབ།
en: Who could attain awakening in this world, bereft of the opportunity to give thoroughly?

source: །སྦྱིན་སོགས་ཕ་རོལ་ཕྱིན་དྲུག་ཚུལ་གྱིས་ཡོན་ཏན་མཆོག་ཅན་གྱི།
en: By means of the six perfections beginning with giving, bodhisattvas

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཀུན་མཁྱེན་ཉིད་མཆོག་རྟག་ཏུ་འཐོབ།
en: Who are possessed of the best qualities always attain supreme omniscience.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཆོག་ཏུ་དགའ་བས་ཡང་རྟ་དང་ལྡན་པའི་ཤིང་རྟ་དེ་བྲམ་ཟེ་དེ་ལ་བྱིན་ནས་སྨྲས་པ།
en: “And so, greatly pleased, the bodhisattva gave the chariot, along with its horses, to the brahmin and said:

source: བྲམ་ཟེ་སེར་སྣའི་དྲི་མ་སེལ་བྱེད་པ།
en: “ ‘O brahmin, by this removal of the impurity of greed,

source: །ཤིང་རྟ་རབ་ཏུ་བྱིན་པ་འདི་ཡིས་འདིར།
en: This giving away the chariot, in this world I will advance the chariot of the great untainted Dharma

source: །བདག་ནི་དྲང་སྲོང་ཆེ་མཆོག་གིས་བསྐོར་བའི།
en: That has been advanced by the greatest ṛṣis.’

source: །ཟག་མེད་ཆོས་ཀྱི་ཤིང་རྟ་ཆེ་སྐོར་ཤོག །དེ་ནས་ཐམས་ཅད་སྒྲོལ་གྱིས་སྙིང་རབ་ཏུ་དགའ་བས་ཤིང་རྟའི་མཆོག་དེ་ཡང་བྲམ་ཟེ་ལ་བྱིན་ནས་གཞོན་ནུ་ནག་པོ་ཕྲག་པ་ལ་ཁྱེར། རྒྱགས་སྦྱིན་མས་ནི་གཞོན་ནུ་མ་དྲ་བ་ཅན་ཁྱེར་ནས་དཀའ་ཐུབ་ཀྱི་ནགས་ལོགས་སུ་ཆས་པ་དང་རིམ་གྱིས་དཀའ་ཐུབ་ཀྱི་ནགས་སུ་ཕྱིན་ཏོ། །དེ་ནས་ཐམས་ཅད་སྒྲོལ་དཀའ་ཐུབ་ཚལ་དེར་རང་གི་སྙིང་མགུ་བར་བྱེད་པའི་བརྟུལ་ཞུགས་བླངས་ཏེ་གནས་སོ།
en: “And so, with his mind greatly pleased, Viśvantara gave that most excellent chariot to the brahmin and went to the forest of ascetics, carrying their son Kṛṣṇa on his shoulder, with Mādrī holding their daughter Jālinī in her arms. They arrived in due course at the forest of ascetics. Thereupon Viśvantara lived in the forest of ascetics, keeping vows that pleased his heart.

source: །ཇི་ཙམ་ན་རྒྱགས་སྦྱིན་མ་རྩ་བ་དང་འབྲས་བུའི་ཕྱིར་དཀའ་ཐུབ་ཀྱི་ནགས་ནས་སོང་བ་དང་། བྲམ་ཟེ་ཞིག་ཐམས་ཅད་སྒྲོལ་གྱི་དྲུང་དུ་འོངས་ནས་སྨྲས་པ།
en: “Later, when Mādrī had gone from the forest of ascetics to collect roots and fruits, a certain brahmin came to Viśvantara and said, ‘O kṣatriya prince, victory to you! “ ‘We, husband and wife, are wandering together

source: རྒྱལ་རིགས་གཞོན་ནུ་ཁྱོད་རྒྱལ་བར་གྱུར་ཅིག །བདག་ཅག་བཀོལ་བ་མ་མཆིས་པས།
en: Because we do not have any servants.

source: །སྤ་ཤུག་ལྷན་ཅིག་འཁྱམ་བགྱིད་ན།
en: It would therefore be appropriate that you

source: །དེ་ཡི་དོན་དུ་བུས་པ་གཉིས། །ཁྱོད་ཀྱིས་བདག་ལ་སྦྱིན་པའི་རིགས།
en: Give us your two children.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་སྒྲོལ་བུ་སྡུག་པ་གཏོང་བ་ལ་ཅུང་ཞིག་སེམས་ཤིང་འདུག་པ་དང་། དེ་ནས་བྲམ་ཟེ་དེས་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་སྒྲོལ་ལ་སྨྲས་པ། ཀྱེ་རྒྱལ་རིགས་གཞོན་ནུ་བདག་གིས་ཁྱོད་ཐམས་ཅད་སྟེར་བའི་ཞེས་ཐོས་ན་འདི་ལྟར་ཁྱོད་ལ་བདག་གིས་བསླངས་པ་དེ་ལ་ཅི་ཞིག་དཔྱད་དུ་ཡོད།
en: “Having been told this, the bodhisattva Viśvantara pondered for a while about giving away his beloved children. Then the brahmin said to the bodhisattva Viśvantara, ‘O kṣatriya prince, I am asking you this because I have heard that you give away everything. What do you have to consider about this?

source: ཁྱེད་ནི་ཀུན་སྟེར་སྙིང་རྗེ་ཡི།
en: “ ‘As a giver who is naturally compassionate,

source: །བདག་ཉིད་ཅན་དུ་ས་སྟེངས་གྲགས།
en: You are renowned throughout the world. It is therefore appropriate for you to act

source: །ཇི་ལྟར་གྲགས་པ་དེ་བཞིན་དུ། །ཁྱོད་ཀྱིས་རྟག་ཏུ་བྱ་བའི་རིགས།
en: Always in the way you are renowned.’

source: །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་སྒྲོལ་གྱིས་བྲམ་ཟེ་དེ་ལ་སྨྲས་པ། ཀྱེ་བྲམ་ཟེ་ཆེན་པོ།
en: “Having been spoken to like this, the bodhisattva Viśvantara said to the brahmin, ‘O great brahmin, “ ‘I would not mind for one moment

source: རང་གི་སྲོག་ནི་གཏོང་བ་ལའང་།
en: Giving even my own life,

source: །ལན་འགའ་དཔྱོད་པ་མ་མྱོང་ན།
en: So, why would I change my mind

source: །རང་གི་བུ་ནི་བཏང་བ་ལ། །བདག་བློ་གཞན་དུ་གྱུར་ཅི་སྨོས།
en: About giving away my children?

source: །བྲམ་ཟེ་ཆེན་པོ་དེ་ལྟ་མོད་ཀྱི།
en: “ ‘Great brahmin, however, “ ‘I wonder, after I abandon these two children

source: བདག་གིས་ནགས་སུ་བསྐྱེད་བསྐྱེད་པའི།
en: Who have grown up in the forest,

source: །བུས་པ་འདི་གཉིས་ཡོངས་སྤངས་ནས།
en: How they will live

source: །མ་དང་བྲལ་བའི་ཉོན་མོངས་པ།
en: With the sorrow of separation from their mother.

source: །འདི་དག་ཇི་ལྟར་གནས་སྙམ་མོད།
en: “ ‘Someone will scold me:

source: །གཞོན་ནུ་ཤིན་ཏུ་བརྩེ་མེད་པས།
en: “The prince is so pitiless

source: །བུས་པ་བཏང་ལ་བདག་མིན་ཞེས། །ཁ་ཅིག་བདག་ལ་ཕྱར་འོང་གིས།
en: That he gives away his children, but not himself.”

source: །བྲམ་ཟེ་བདག་ནི་ཁྲིད་ན་ལེགས།
en: O brahmin, please instruct me.’

source: །དེ་ནས་བྲམ་ཟེ་དེས་ཐམས་ཅད་སྒྲོལ་ལ་སྨྲས་པ། ཀྱེ་རྒྱལ་རིགས་གཞོན་ནུ་རྒྱལ་པོ་ཆེན་པོའི་རིགས་སུ་སྐྱེས་པ།
en: “Then the brahmin said to Viśvantara, ‘O kṣatriya prince, it is not appropriate for you, who were born to a lineage of great kings;

source: ས་འདི་ཐམས་ཅད་དུ་ཡོན་ཏན་གྲགས་པ།
en: whose good qualities are renowned all over this world;

source: སྲོག་ཆགས་ཐམས་ཅད་ལ་སྙིང་བརྩེ་བས་བྱམས་པར་ཞུགས་པ།
en: who loves all beings with compassion;

source: སྦྱིན་པ་དང་། མཆོད་པ་དང་། བཀུར་སྟིས་སྤོས་ཀྱི་གླང་པོ་ཆེ་ལྟ་བུ།
en: who is unstoppable just like a rutting elephant in practicing generosity, veneration, and honor;

source: དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། གློ་བུར་བའི་སྐྱེ་བོ་ལ་མཆོད་པ་བྱེད་པ།
en: who venerates śramaṇas, brahmins, and guests;

source: སྐྱེ་བོ་བཀྲེན་པ་དང་། ཕོངས་པ་དང་། མགོན་མེད་པ་དང་། ལྟོགས་པ་ཡོངས་སུ་སྡུད་པ།
en: who accepts those who are poor, destitute, helpless, and hungry;

source: ཐམས་ཅད་ཀྱི་རེ་བ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ།
en: who fulfills everyone’s wishes;

source: མཐོང་ན་དོན་ཡོད་པ་ཁྱོད་ཀྱིས་བདག་འོངས་པ་ནོམ་པ་མེད་པའམ། ལམ་གྱིས་དུབ་པ་འབྲས་བུ་མེད་པའམ། མཐོང་བ་དོན་མེད་པའམ། རེ་བ་དང་ཡུན་རིང་པོ་ནས་བརྣག་བརྣག་པའི་འདོད་པ་འབྲས་བུ་མེད་པར་བྱ་བ་གང་ཡིན་པ་དེ་ནི་ཆ་མ་ཡིན་ཏེ།
en: and who is beneficial to see, to make my coming in vain, my effort of traveling unfruitful, my seeing you not beneficial, and my wish and desire for which I have been struggling for a long time unfruitful.

source: ཁྱོད་ཀྱི་མེད་དོ་ཞེས་བྱ་བའི་ཚིག་གིས་ཁོ་བོའི་ཡིད་ལ་རེ་བ་ཀུན་ཏུ་རྟོག་པའི་རྟ་བཏབ་ན་མྱུར་དུ་ལྡོག་པར་འགྱུར་རོ། །དེ་བས་ན་ཁྱོད་ཀྱིས་བདག་གི་ཡིད་ལ་རེ་བ་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས་གཏང་བའི་རིགས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: If my chariot of mind (manoratha, “wish”), whose horses are thoughts, is struck by your words of refusal, it will quickly return. Therefore, it is appropriate for you to satisfy my wish and give them. Why? “ ‘Even if one were to search the entire earth with its cities and villages,

source: ཆུ་གཏེར་གོས་སུ་གྱོན་ཞིང་གཟའ་མིག་མཚུངས་མེད་པ།
en: Which wears oceans as garments, whose incomparable eyes are planets,

source: །རི་བོ་མཆོག་རྒྱས་ནུ་མར་ལྡན་པའི་རོ་སྟོད་ཅན། །གྲོང་ཁྱེར་གྲོང་རྡལ་བཅས་པའི་ས་ལ་བཙལ་བྱས་ཀྱང་།
en: Whose torso has great, excellent mountains as breasts,

source: །མཆེ་བཟངས་ཁྱོད་དང་མཚུངས་པར་གཏོང་ཕོད་ཡོད་མ་ཡིན།
en: There would be no one as generous as you, O you who have beautiful teeth.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་སྒྲོལ་གྱིས་བྲམ་ཟེའི་ཚིག་དེ་ཐོས་ནས་བུ་ལ་ཆགས་པའི་བློང་བས་འདི་དག་སེམས་པར་བྱེད་དེ།
en: “When he had heard these words of the brahmin, the bodhisattva Viśvantara was overcome by attachment to his children and worried: “ ‘First, if I give

source: གལ་ཏེ་རེ་ཞིག་བུ་གཉིས་པོ། །བྲམ་ཟེར་བྱིན་ན་བུ་དང་ནི།
en: The two children to the brahmin,

source: །བྲལ་བ་ལས་བྱུང་སྡུག་བསྔལ་དག །བདག་དང་རྒྱགས་བྱིན་གྱིས་ཐོབ་འགྱུར།
en: I and Mādrī will suffer the pain Of separation from them.

source: །འོན་ཀྱང་འདི་ལ་མ་བྱིན་ན།
en: “ ‘However, if I do not give them to him,

source: །བརྟུལ་ཞུགས་ལས་ཀྱང་ཉམས་འགྱུར་ཞིང་།
en: My vow will be ruined,

source: །བྲམ་ཟེ་འདི་ནི་ཚི་ཆད་དེ།
en: And this brahmin will leave

source: །ཇི་ལྟར་འོངས་པ་བཞིན་དུ་འགྲོ།
en: Disappointed, without gaining anything.

source: །ཉིས་ན་བུ་བྲལ་ཉམ་ཐག་པའི།
en: “ ‘Second, depressed by separation from my children,

source: །མྱ་ངན་ས་སྟེངས་བདག་གིས་བླང་།
en: I will feel sorrow on the face of the earth.

source: །དེ་བཞིན་མ་བྱས་དམ་བཅས་པ།
en: Otherwise, the promise I made,

source: །ཞིག་ཅིང་བརྟུལ་ཞུགས་ཉམས་པར་འགྱུར།
en: My vow, will be ruined.’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་སྒྲོལ་གྱིས་སྡུག་པའི་བུ་གཉིས་ངེས་པར་གཏོང་བར་ཆད་ནས་སྨྲས་པ།
en: “Then the bodhisattva Viśvantara decided definitely to give his two beloved children away and declared:

source: ཀྱེ་ཁོ་བོས་དཀའ་སྤྱད་བརྒྱ་ཡིས་འཇིག་རྟེན་སྡུག་བསྔལ་གྱི།
en: “ ‘I will build a bridge with a hundred difficult acts To lead the world, which has sunk
